app/views/author/show.html.erb

<p>email : <%= @user.email %></p>
<p>City : <%= @city.find(@user.city_id).name %></p>
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]